# ──────────────────────────────────────────────────
# 作業フロー
# ──────────────────────────────────────────────────
# steps番号
# 管理画面（http://127.0.0.1:8000/admin/）のIDより確認


FLOWS = {
# ──────────────────────────────────────────────────

        "python_venv_create": {
        
        "title": "仮想環境を作成する",

        "description": """

        ・コマンドプロンプトで作業します。
        ・仮想環境はPCごとに作成します。
        ・別のPCで作業する場合は、そのPCでも仮想環境を作成します。
        ・仮想環境フォルダはGitでは共有しません。

        """,
        
        "steps": [9, 1, ],
    },
# ──────────────────────────────────────────────────

        "venv_activate": {
       
        "title": "仮想環境を有効にする",
       
        "description": """

        """,

        "steps": [9, 12, 4, 13, 14],
    },
# ──────────────────────────────────────────────────

    "github": {

        "title": "GitHub Push",

        "description": "変更内容をGitHubへ反映する",

        "steps": [4, 5, 6],
    },
# ──────────────────────────────────────────────────


}